/* CLLocationManager error kCLErrorRangingFailure */
"A general ranging error occurred." = "Une erreur générale de localisation proche a eu lieu.";

/* CLLocationManager error kCLErrorRegionMonitoringFailure */
"A registered region cannot be monitored." = "Une région enregistrée n'a pas pu être suivie.";

/* CLLocationManager error kCLErrorDenied */
"Access to the location service was denied by the user." = "L'accès au service de localisation a été refusé par l'utilisateur.";

/* CLLocationManager error kCLErrorRegionMonitoringDenied */
"Access to the region monitoring service was denied by the user." = "L'accès au service de suivi de région a été refusé par l'utilisateur.";

/* CLLocationManager error kCLErrorRegionMonitoringSetupDelayed */
"Core Location could not initialize the region monitoring feature immediately." = "Core Location ne peut pas initialiser immédiatement la fonctionnalité de suivi de région.";

/* CLLocationManager error kCLErrorRegionMonitoringResponseDelayed */
"Core Location will deliver events but they may be delayed." = "Core Location délivrera des événements, mais ils peuvent être retardés.";

/* CLLocationManager error kCLErrorDeferredDistanceFiltered */
"Deferred mode does not support distance filters." = "Le mode différé ne supporte pas les filtres de distance.";

/* CLLocationManager error kCLErrorDeferredAccuracyTooLow */
"Deferred mode is not supported for the requested accuracy." = "Le mode différé n'est pas supporté pour la précison demandée.";

/* CLLocationManager error kCLErrorRangingUnavailable */
"Ranging is disabled. This might happen if the device is in Airplane mode or if Bluetooth or location services are disabled." = "La localisation proche est désactivée. Cela pourrait se produire si l'appareil est en mode Avion ou si les services Bluetooth ou de localisation sont désactivés.";

/* CLLocationManager error kCLErrorGeocodeCanceled */
"The geocode request was canceled." = "La demande de géocodage a été annulée.";

/* CLLocationManager error kCLErrorGeocodeFoundPartialResult */
"The geocode request yielded a partial result." = "La demande de géocodage n'a donné un résultat partiel.";

/* CLLocationManager error kCLErrorGeocodeFoundNoResult */
"The geocode request yielded no result." = "La demande de géocodage n'a donné aucun résultat.";

/* CLLocationManager error kCLErrorHeadingFailure */
"The heading could not be determined." = "L'orientation n'a pas pu être déterminée";

/* CLLocationManager error kCLErrorDeferredNotUpdatingLocation */
"The location manager did not enter deferred mode because location updates were already disabled or paused." = "Le gestionnaire de position n'est pas passé en mode différé car les mises à jour localisation ont déjà été désactivées ou mises en pause.";

/* CLLocationManager error kCLErrorDeferredFailed */
"The location manager did not enter deferred mode for an unknown reason." = "Le gestionnaire de position n'est pas entré en mode différé pour une raison inconnue.";

/* CLLocationManager error kCLErrorLocationUnknown */
"The location manager was unable to obtain a location value right now." = "Le gestionnaire de position n'a pas réussi à obtenir une position pour le moment.";

/* CLLocationManager error kCLErrorNetwork */
"The network was unavailable or a network error occurred." = "Le réseau est indisponible ou une erreur réseau a eu lieu.";

/* CLLocationManager error kCLErrorDeferredCanceled */
"The request for deferred updates was canceled by a subsequent call." = "La demande de mises à jour différées a été annulée par un appel ultérieur.";

